# EnergyAnalysisZone Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisZone Class
Members See Also
---
Analytical zone.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class EnergyAnalysisZone : Element
```

Visual Basic
---
```text
Public Class EnergyAnalysisZone _
	Inherits Element
```

Visual C++
---
```text
public ref class EnergyAnalysisZone : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..EnergyAnalysisZone
# See Also
EnergyAnalysisZone Members
Autodesk.Revit.DB.Analysis Namespace